request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://my_domain.com/compute_vat_net_gross">
   <soapenv:Header/>
   <soapenv:Body>
      <gs:getJobsRequest>
	   <gs:job>
	     <gs:amount>
	       <gs:gross_amount>
		 2407
	       </gs:gross_amount>
	     </gs:amount>
	     <gs:vat_rate>
	       12.0
	     </gs:vat_rate>
	  </gs:job>
          <gs:job>
	     <gs:amount>
	       <gs:vat_amount>
		 247
	       </gs:vat_amount>
	     </gs:amount>
	     <gs:vat_rate>
	       12.0
	     </gs:vat_rate>
	  </gs:job>
          <gs:job>
	     <gs:amount>
	       <gs:net_amount>
		 231
	       </gs:net_amount>
	     </gs:amount>
	     <gs:vat_rate>
	       12.0
	     </gs:vat_rate>
	  </gs:job>
      </gs:getJobsRequest>
   </soapenv:Body>
</soapenv:Envelope>
